def legs(): #В случае, если ищем гипотенузу по двум катетам
    try:
        a = int(input("Введите числом длину первого катета\n"))
        b = int(input("Введите числом длину второго катета\n"))
    except ValueError:
        print("Введите целое число")
        return None
    if a <= 0 or b <= 0:
        print("Сторона не может быть отрицательной или нулевой")
        return None
    c = (a ** 2 + b ** 2) ** 0.5
    print(f"Третья сторона (гипотенуза) равна {c:.2f}")

def not_legs(): #Второй сценарий, если ищем по катету и гипотенузе
    try:
        a = int(input("Введите числом длину катета\n"))
        c = int(input("Введите числом длину гипотенузы\n"))
    except ValueError:
        print("Введите целое число")
        return None
    if a <= 0 or c <= 0:
        print("Сторона не может быть отрицательной или нулевой")
        return None
    if c <= a:
        print("Гипотенуза должна быть больше катета")
        return None
    b = (c**2 - a**2) ** 0.5
    print(f"Третья сторона (катет) равна {b:.2f}")

if __name__ == "__main__":
    ask1 = input("Ваши стороны это катеты? Введите да/нет\n")
    if ask1.lower() == "да":
        legs()
    else:
        ask2 = input("Ваши стороны это катет и гипотинуза? Введите да/нет\n")
        if ask2.lower() == "да":
            not_legs()
        else:
            print("Предполагаю, что катеты и отказываюсь от ответственности за неверный результат\n")
            legs()
